# Hands-on 4

### CS2545 - Data Science ###
### Fall, 2021 ###
### UNB, Fredericton ###

Please complete the following and submit this notebook (filename: handson4-**lastname**-**firstname**.ipynb) to D2L by 11:30 am, Friday, October 29. 
</br>
</br>
</br>

**Q1.** Download *user.csv*  from D2L. The entries in *user*  represent movie reviewers.

Add a column to the dataframe called *agegroup*, where the value of *agegroup* is a label based on the following table. Using this table, you can create relevant intervals (i.e. left-open and right-closed intervals).

Infant: 0-1 <br>
Toddler: 1-3 <br>
Children: 3-12 <br>
Teen: 12-19  <br>
Young-adult: 19-25 <br> 
Adult: 25 - 65 <br>
Senior: 65 - 110 <br>

So, someone aged 13 will be labeled 'Teen'

In [2]:
import pandas as pd
import numpy as np

u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
user = pd.read_csv('user.csv', sep='|', names=u_cols)


# write your code below
def getagegroup(age) -> str:
    ag =''
    if(age >=0 and age <= 1):
        ag = 'infant'
    if(age >1 and age <=3):
        ag = 'toddler'
    if(age >3 and age<= 12):
        ag='children'
    if (age>12 and age <= 19):
        ag ='teen'
    if(age>19 and age<=25):
        ag='young-adult'
    if(age>25 and age <=65):
        ag = 'adult'
    if(age>65 and age<=110):
        ag = 'senior'
    return ag
user['agegroup'] = user['age'].apply(getagegroup)
user

     user_id  age sex     occupation zip_code     agegroup
0          1   24   M     technician    85711  young-adult
1          2   53   F          other    94043        adult
2          3   23   M         writer    32067  young-adult
3          4   24   M     technician    43537  young-adult
4          5   33   F          other    15213        adult
..       ...  ...  ..            ...      ...          ...
938      939   26   F        student    33319        adult
939      940   32   M  administrator    02215        adult
940      941   20   M        student    97229  young-adult
941      942   48   F      librarian    78209        adult
942      943   22   M        student    77841  young-adult

[943 rows x 6 columns]

**Q2.1**  Download the *rating.csv*  from D2L.  The entries in *rating* represents the movie ratings given by these reviewers. 
Also, you will need the *user* data frame with column *agegroup* from  Q1. 

Join these two data frames to create a new data frame.


**Q2.2**  Print the movie ids of the top rated movies (rating > 4) that are rated by either Teens or Seniors.

In [5]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
rating = pd.read_csv('rating.csv', sep='\t', names=r_cols)

# write your code below

# Q2.1
urdf = pd.merge(user,rating)


# Q2.2
p = urdf[(urdf['rating']>4) & ((urdf['agegroup']=='teen')|(urdf['agegroup']=='senior'))]
p['movie_id']

4087     339
4090     883
4092     882
4094     885
4098     358
        ...
96437    274
96447    255
96452    785
96454    280
98293    288
Name: movie_id, Length: 1833, dtype: int64

**Q3.**  Using the dataframe in Q2.1, show the average movie rating for each agegroup. Remove records with NaN fields.

In [15]:
# write your code below
urdf = urdf.dropna()
urdf = urdf.groupby('agegroup')

agegroup
adult          3.550149
children       3.425743
senior         3.589212
teen           3.488366
young-adult    3.481513
Name: rating, dtype: float64